{"name":"Jérémy","headerTaglineOne":"Salut 👋","headerTaglineTwo":"Je suis Jérémy Boloh,","headerTaglineThree":"developpeur front-end","showBlog":true,"darkMode":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/Jey29"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/j%C3%A9r%C3%A9my-boloh-399a1391/"},{"id":"3","title":"Twitter","link":"https://twitter.com/BolohJ"},{"id":"5","title":"Email","link":"mailto:boloh.jeremy@gmail.com"}],"projects":[{"id":"1","title":"Booki","description":"L'entreprise Booki souhaite développer un site internet qui permette aux usagers de trouver des hébergements et des activités dans la ville de leur choix. J'ai été chargé d'intégrer l'interface du site avec du code HTML et CSS.","imageSrc":"../images/projets/booki.png","url":"https://github.com/Jey29/P2openclassrooms"},{"id":"2","title":"Portfolio d'une architecte d'interieur","description":"Notre cliente,Sophie Bluel,souhaite que nous lui developpions un portfolio avec ses différents projets d'architecte. J'ai été chargé de développer la partie front-end en Javascript.","imageSrc":"../images/projets/sophiebluel.png","url":"https://github.com/Jey29/Portfolio-architecte-sophie-bluel"},{"id":"3","title":"Optimisation SEO","description":"Nina Carducci possède un portfolio comprenant beaucoup d'images. Son site n'est pas bien optimisé et quelques bugs sont présents. Après audit,je lui propose d'optimiser les images,le code et sa structure de son site et de corriger les bugs.","imageSrc":"../images/projets/nina.jpg","url":"https://github.com/Jey29/P5-OC"},{"id":"4","title":"Kasa","description":"Je suis recruté par Kasa,leader de la location d'appartements entre particulier,en tant que freelance pour développer sa nouvelle platforme web. Le site a été codé il y a plus 10 de ans en ASP.NET et j'ai été chargé de recoder le site en React.","imageSrc":"../images/projets/kasa.png","url":"https://github.com/Jey29/P6-OC"},{"id":"5","title":"Mon vieux grimoire","description":"La chaîne de librairies souhaite ouvrir un site de notation de livres qui permettra aux membres d'ajouter un nouveau livre et de mettre une note visible par le public. J'ai été chargé de developper la partie back end du site en node.js.","imageSrc":"../images/projets/vieuxgrimoire.png","url":"https://github.com/Jey29/P7-OC"}],"services":[{"id":"1","title":"HTML","description":"Avec des compétences en HTML,je suis capable de créer la structure de base des pages web en utilisant des balises. Je peux organiser le contenu en titres,paragraphes,listes,et insérer des liens et des images. Grâce à HTML,je peux définir la base de tout site web et permettre aux utilisateurs d'interagir avec le contenu."},{"id":"2","title":"CSS","description":"Grâce à mes compétences en CSS,je suis en mesure de donner vie aux pages web en appliquant des styles et en gérant la présentation visuelle. Je peux personnaliser les couleurs,les polices,les marges,les dispositions et créer des animations pour rendre les sites web attrayants et conviviaux."},{"id":"3","title":"JavaScript","description":"Avec des compétences en JavaScript,je peux rendre mes pages web interactives et dynamiques. Je peux manipuler le contenu en temps réel,ajouter des fonctionnalités interactives,créer des formulaires,et réagir aux actions des utilisateurs. JavaScript me permet de développer des applications web puissantes et réactives."},{"id":"4","title":"React","description":"Grâce à React,une bibliothèque JavaScript,je peux créer des interfaces utilisateur complexes et réutilisables. Je suis capable de diviser l'interface en composants indépendants et gérer leur état pour créer des applications à chargement rapide et fluides. React me permet de développer des applications web modernes et performantes."},{"id":"5","title":"Node.js","description":"Avec des compétences en Node.js,je peux développer des applications côté serveur en utilisant JavaScript. Node.js me permet d'accéder à des fonctionnalités avancées,de gérer des fichiers,d'effectuer des opérations réseau et de créer des serveurs web. Grâce à Node.js,je peux créer des applications web complètes de bout en bout."},{"id":"6","title":"SEO (Search Engine Optimization)","description":"Avec des compétences en SEO,je peux optimiser les sites web pour améliorer leur visibilité et leur classement dans les moteurs de recherche. Je maîtrise les techniques d'optimisation de contenu,de mots-clés,de liens et d'analyse pour attirer plus de trafic organique et améliorer la présence en ligne."}],"aboutpara":"Je suis un développeur web tout juste sorti d'une formation chez OpenClassrooms,et ma passion pour le code et les nouvelles technologies ne fait que grandir. Mon parcours dans le monde du développement web m'a permis de découvrir un univers fascinant où la créativité et l'innovation se mêlent harmonieusement","resume":{"tagline":"👋 Je suis developpeur web Front-end","description":"Je suis un jeune développeur web en perfectionnement de ses compétences","experiences":[{"id":"1","dates":"Decembre 2022 - Juillet 2023","type":"Temps complet","position":"Etudiant chez Openclass Rooms","bullets":["Formation developpeur web"]}],"languages":["Javascript","HTML5","CSS","Sass"],"frameworks":["React","NodeJs","Express"],"others":["Figma"]}}